// Q 3의 배수 인가요?
// 영희는 친구와 게임을 하고 있습니다.
// 서로 돌아가며 랜덤으로 숫자를 하나 말하고 그게 3의 배수이면 박수를 치고
// 아니면 그 숫자를 그대로 말하는 게임입니다.
// 입력으로 랜덤한 숫자 n이 주어집니다.
// 만약 그 수가 3의 배수라면 '짝'이라는 글자를, 3의 배수가 아니라면 n을 그대로 출력해 주세요.

입출력;
입력: 3;
출력: 짝;
입력: 2;
출력: 2;

// Answer
//Omuing => 4자리에 숫자 바꿔서 넣으면 됨
let number = [1, 2, 3, 4, 5, 6, 7, 8];
if (number[4 - 1] % 3 === 0) {
  console.log("짝수");
} else {
  console.log("홀수");
// 🙈 Oum 1 - 2회독 중
const n = prompt();
if (n % 3 === 0 && n != 0) {
  console.log("짝");
} else {
  console.log(n);
}

//sjshin

//🌸 sePark 🌸
// function numberGame(n) {
//   if (n % 3 === 0){
//     console.log('짝')
//   }else {
//     console.log(n)
//   }
// }
// numberGame(6) //'짝' 출력
// numbermber(4) // 4 출력

<<<<<<< HEAD
// YS.kim
const threeCheck = (num) => {
  if (num % 3 === 0) console.log("짝");
  else console.log(num);
};

threeCheck(3);
threeCheck(2);
=======
//kh
// const n = prompt('숫자를 입력하세요.');
// console.log(n%3===0 ? `짝` : `${n}`)
>>>>>>> js/master
