// Q 괄호 문자열
// 괄호 문자열이란 괄호 기호인 '{', '}', '[', ']', '(', ')' 와 같은 것을 말한다. 그중 괄호의 모양이 바르게 구성된 문자열을 바른 문자열, 그렇지 않은 문자열을 바르지 않은 문자열이라 부르도록 하자.

// (())와 같은 문자열은 바른 문자열이지만 ()()) 와 같은 문자열은 바르지 않은 문자열이다.
// (해당 문제에서는 소괄호만 판별하지만,  중괄호와 대괄호까지 판별해 보세요.)

// 입력으로 주어진 괄호 문자열이 바른 문자열인지 바르지 않은 문자열인지 "YES"와 "NO"로 구분된 문자열을 출력해보자.

// Answer
// 🙈 Oum 1회독 => 어려운데 이해가 조금 됨
function mathBrackets(e) {
  let count = 0;
  //괄호 개수가 같지 않으면 false
  for (let i = 0; i < e.length; i++) {
    if (e[i] === '(') {
      count++;
    }
    if (e[i] === ')') {
      count--;
    }
  }
  console.log(count);
  if (count !== 0) {
    return false;
  }
  if (count == 0) {
    return true;
  }
  console.log(count);
}
const n = '())'.split(''); // (())) 여기를 갯수에 맞게 추가하거나 수정하면 fasle, ture 가나옴
console.log(n);
console.log(mathBrackets(n));

//sjshin

// 🌸 sePark 🌸
